Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/atdf/PIC32MZ1024EFF124.atdf
      <value-group caption="Error Code bits" name="SBT6ELOG1__CODE">
         <value caption="Reserved" name="" value="0xf"/>
         <value caption="Reserved" name="" value="0xd"/>
         <value caption="Permission violation" name="" value="0x3"/>
         <value caption="Reserved" name="" value="0x2"/>
         <value caption="Reserved" name="" value="0x1"/>
         <value caption="No error" name="" value="0x0"/>
      </value-group>
      <value-group caption="Multiple Permission Violations Status bit" name="SBT6ELOG1__MULTI">
         <value caption="Multiple errors have been detected" name="" value="0x1L"/>
         <value caption="No multiple errors have been detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transaction Command of the Requester bits" name="SBT7ELOG1__CMD">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x6"/>
         <value caption="Write (a non-posted write)" name="" value="0x5"/>
         <value caption="Reserved" name="" value="0x4"/>
         <value caption="Read (a locked read caused by a Read-Modify-Write transaction)" name="" value="0x3"/>
         <value caption="Read" name="" value="0x2"/>
         <value caption="Write" name="" value="0x1"/>
         <value caption="Idle" name="" value="0x0"/>
      </value-group>
      <value-group caption="Requested Region Number bits" name="SBT7ELOG1__REGION">
         <value caption="Targets region that reported a permission group violation" name="" value="1111 - 0000"/>
      </value-group>
      <value-group caption="Initiator ID of Requester bits" name="SBT7ELOG1__INITID">
         <value caption="Reserved" name="" value="0xff"/>
         <value caption="Reserved" name="" value="0xf"/>
         <value caption="Crypto Engine" name="" value="0xe"/>
         <value caption="Flash Controller" name="" value="0xd"/>
         <value caption="SQI1" name="" value="0xc"/>
         <value caption="CAN2" name="" value="0xb"/>
         <value caption="CAN1" name="" value="0xa"/>
         <value caption="Ethernet Write" name="" value="0x9"/>
         <value caption="Ethernet Read" name="" value="0x8"/>
         <value caption="USB" name="" value="0x7"/>
         <value caption="DMA Write (DMAPRI (CFGCON) = 1)" name="" value="0x6"/>
         <value caption="DMA Write (DMAPRI (CFGCON) = 0)" name="" value="0x5"/>
         <value caption="DMA Read (DMAPRI (CFGCON) = 1)" name="" value="0x4"/>
         <value caption="DMA Read (DMAPRI (CFGCON) = 0)" name="" value="0x3"/>
         <value caption="CPU (CPUPRI (CFGCON) = 1)" name="" value="0x2"/>
         <value caption="CPU (CPUPRI (CFGCON) = 0)" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Code bits" name="SBT7ELOG1__CODE">
         <value caption="Reserved" name="" value="0xf"/>
         <value caption="Reserved" name="" value="0xd"/>
         <value caption="Permission violation" name="" value="0x3"/>
         <value caption="Reserved" name="" value="0x2"/>
         <value caption="Reserved" name="" value="0x1"/>
         <value caption="No error" name="" value="0x0"/>
      </value-group>
      <value-group caption="Multiple Permission Violations Status bit" name="SBT7ELOG1__MULTI">
         <value caption="Multiple errors have been detected" name="" value="0x1L"/>
         <value caption="No multiple errors have been detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transaction Command of the Requester bits" name="SBT8ELOG1__CMD">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x6"/>
         <value caption="Write (a non-posted write)" name="" value="0x5"/>
         <value caption="Reserved" name="" value="0x4"/>
         <value caption="Read (a locked read caused by a Read-Modify-Write transaction)" name="" value="0x3"/>
         <value caption="Read" name="" value="0x2"/>
         <value caption="Write" name="" value="0x1"/>
         <value caption="Idle" name="" value="0x0"/>
      </value-group>
      <value-group caption="Requested Region Number bits" name="SBT8ELOG1__REGION">
         <value caption="Targets region that reported a permission group violation" name="" value="1111 - 0000"/>
      </value-group>
      <value-group caption="Initiator ID of Requester bits" name="SBT8ELOG1__INITID">
         <value caption="Reserved" name="" value="0xff"/>
         <value caption="Reserved" name="" value="0xf"/>
         <value caption="Crypto Engine" name="" value="0xe"/>
         <value caption="Flash Controller" name="" value="0xd"/>
         <value caption="SQI1" name="" value="0xc"/>
         <value caption="CAN2" name="" value="0xb"/>
         <value caption="CAN1" name="" value="0xa"/>
         <value caption="Ethernet Write" name="" value="0x9"/>
         <value caption="Ethernet Read" name="" value="0x8"/>
         <value caption="USB" name="" value="0x7"/>
         <value caption="DMA Write (DMAPRI (CFGCON) = 1)" name="" value="0x6"/>
         <value caption="DMA Write (DMAPRI (CFGCON) = 0)" name="" value="0x5"/>
         <value caption="DMA Read (DMAPRI (CFGCON) = 1)" name="" value="0x4"/>
         <value caption="DMA Read (DMAPRI (CFGCON) = 0)" name="" value="0x3"/>
         <value caption="CPU (CPUPRI (CFGCON) = 1)" name="" value="0x2"/>
         <value caption="CPU (CPUPRI (CFGCON) = 0)" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Code bits" name="SBT8ELOG1__CODE">
         <value caption="Reserved" name="" value="0xf"/>
         <value caption="Reserved" name="" value="0xd"/>
         <value caption="Permission violation" name="" value="0x3"/>
         <value caption="Reserved" name="" value="0x2"/>
         <value caption="Reserved" name="" value="0x1"/>
         <value caption="No error" name="" value="0x0"/>
      </value-group>
      <value-group caption="Multiple Permission Violations Status bit" name="SBT8ELOG1__MULTI">
         <value caption="Multiple errors have been detected" name="" value="0x1L"/>
         <value caption="No multiple errors have been detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transaction Command of the Requester bits" name="SBT9ELOG1__CMD">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x6"/>
         <value caption="Write (a non-posted write)" name="" value="0x5"/>
         <value caption="Reserved" name="" value="0x4"/>
         <value caption="Read (a locked read caused by a Read-Modify-Write transaction)" name="" value="0x3"/>
         <value caption="Read" name="" value="0x2"/>
         <value caption="Write" name="" value="0x1"/>
         <value caption="Idle" name="" value="0x0"/>
      </value-group>
      <value-group caption="Requested Region Number bits" name="SBT9ELOG1__REGION">
         <value caption="Targets region that reported a permission group violation" name="" value="1111 - 0000"/>
      </value-group>
      <value-group caption="Initiator ID of Requester bits" name="SBT9ELOG1__INITID">
         <value caption="Reserved" name="" value="0xff"/>
         <value caption="Reserved" name="" value="0xf"/>
         <value caption="Crypto Engine" name="" value="0xe"/>
         <value caption="Flash Controller" name="" value="0xd"/>
         <value caption="SQI1" name="" value="0xc"/>
         <value caption="CAN2" name="" value="0xb"/>
         <value caption="CAN1" name="" value="0xa"/>
         <value caption="Ethernet Write" name="" value="0x9"/>
         <value caption="Ethernet Read" name="" value="0x8"/>
         <value caption="USB" name="" value="0x7"/>
         <value caption="DMA Write (DMAPRI (CFGCON) = 1)" name="" value="0x6"/>
         <value caption="DMA Write (DMAPRI (CFGCON) = 0)" name="" value="0x5"/>
         <value caption="DMA Read (DMAPRI (CFGCON) = 1)" name="" value="0x4"/>
         <value caption="DMA Read (DMAPRI (CFGCON) = 0)" name="" value="0x3"/>
         <value caption="CPU (CPUPRI (CFGCON) = 1)" name="" value="0x2"/>
         <value caption="CPU (CPUPRI (CFGCON) = 0)" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Code bits" name="SBT9ELOG1__CODE">
         <value caption="Reserved" name="" value="0xf"/>
         <value caption="Reserved" name="" value="0xd"/>
         <value caption="Permission violation" name="" value="0x3"/>
         <value caption="Reserved" name="" value="0x2"/>
         <value caption="Reserved" name="" value="0x1"/>
         <value caption="No error" name="" value="0x0"/>
      </value-group>
      <value-group caption="Multiple Permission Violations Status bit" name="SBT9ELOG1__MULTI">
         <value caption="Multiple errors have been detected" name="" value="0x1L"/>
         <value caption="No multiple errors have been detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transaction Command of the Requester bits" name="SBT10ELOG1__CMD">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x6"/>
         <value caption="Write (a non-posted write)" name="" value="0x5"/>
         <value caption="Reserved" name="" value="0x4"/>
         <value caption="Read (a locked read caused by a Read-Modify-Write transaction)" name="" value="0x3"/>
         <value caption="Read" name="" value="0x2"/>
         <value caption="Write" name="" value="0x1"/>
         <value caption="Idle" name="" value="0x0"/>
      </value-group>
      <value-group caption="Requested Region Number bits" name="SBT10ELOG1__REGION">
         <value caption="Targets region that reported a permission group violation" name="" value="1111 - 0000"/>
      </value-group>
      <value-group caption="Initiator ID of Requester bits" name="SBT10ELOG1__INITID">
         <value caption="Reserved" name="" value="0xff"/>
         <value caption="Reserved" name="" value="0xf"/>
         <value caption="Crypto Engine" name="" value="0xe"/>
         <value caption="Flash Controller" name="" value="0xd"/>
         <value caption="SQI1" name="" value="0xc"/>
         <value caption="CAN2" name="" value="0xb"/>
         <value caption="CAN1" name="" value="0xa"/>
         <value caption="Ethernet Write" name="" value="0x9"/>
         <value caption="Ethernet Read" name="" value="0x8"/>
         <value caption="USB" name="" value="0x7"/>
         <value caption="DMA Write (DMAPRI (CFGCON) = 1)" name="" value="0x6"/>
         <value caption="DMA Write (DMAPRI (CFGCON) = 0)" name="" value="0x5"/>
         <value caption="DMA Read (DMAPRI (CFGCON) = 1)" name="" value="0x4"/>
         <value caption="DMA Read (DMAPRI (CFGCON) = 0)" name="" value="0x3"/>
         <value caption="CPU (CPUPRI (CFGCON) = 1)" name="" value="0x2"/>
         <value caption="CPU (CPUPRI (CFGCON) = 0)" name="" value="0x1"/>
         <value caption="Reserved" name="" value="0x0"/>
      </value-group>
      <value-group caption="Error Code bits" name="SBT10ELOG1__CODE">
         <value caption="Reserved" name="" value="0xf"/>
         <value caption="Reserved" name="" value="0xd"/>
         <value caption="Permission violation" name="" value="0x3"/>
         <value caption="Reserved" name="" value="0x2"/>
         <value caption="Reserved" name="" value="0x1"/>
         <value caption="No error" name="" value="0x0"/>
      </value-group>
      <value-group caption="Multiple Permission Violations Status bit" name="SBT10ELOG1__MULTI">
         <value caption="Multiple errors have been detected" name="" value="0x1L"/>
         <value caption="No multiple errors have been detected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Transaction Command of the Requester bits" name="SBT11ELOG1__CMD">
         <value caption="Reserved" name="" value="0x7"/>
         <value caption="Reserved" name="" value="0x6"/>
         <value caption="Write (a non-posted write)" name="" value="0x5"/>
         <value caption="Reserved" name="" value="0x4"/>
         <value caption="Read (a locked read caused by a Read-Modify-Write transaction)" name="" value="0x3"/>
         <value caption="Read" name="" value="0x2"/>
         <value caption="Write" name="" value="0x1"/>
         <value caption="Idle" name="" value="0x0"/>
      </value-group>
      <value-group caption="Requested Region Number bits" name="SBT11ELOG1__REGION">
         <value caption="Targets region that reported a permission group violation" name="" value="1111 - 0000"/>
      </value-group>
